{
  "backend/main.mo": "Main Motoko actor defining all data types (Episode, Character, Clan, NewsEntry, GalleryImage, UserProfile, ContactMessage, FanMail) and exposing public/admin query and update methods for a fan-site backend, with access control and blob storage mixins included.",
  "backend/migration.mo": "Migration module that declares old and new actor state types (mirroring main.mo's types) and exports a `run` function that currently passes the old state through unchanged as the new state.",
  "feature_evidence.json": "Feature evidence report linking the CharactersPanel bulk-add UI feature to its implementation file, associated components, and test ID REQ-2 with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated text file containing one-to-two sentence summaries of every frontend source file, serving as a quick reference for the frontend codebase structure.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, including color tokens for backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML shell for the Vite/React app, setting the page title to 'Whispers Of The White Moon' and mounting the React root via `/src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (home, admin, donate, profile, quiz, quiz-result, contact) and wraps the app in a React Query provider.",
  "frontend/src/components/About.tsx": "About section component rendering story paragraphs with alternating slide-in scroll animations and three story-pillar cards (World, Conflict, Prophecy) with glow dividers.",
  "frontend/src/components/admin/AccessDenied.tsx": "Displays a styled 'Access Denied' page with an error icon and a link back to the home page, shown when the user lacks admin privileges.",
  "frontend/src/components/admin/AdminDashboard.tsx": "The main admin dashboard layout featuring a sidebar with navigation to content management panels (episodes, characters, news, gallery, clans, messages, fan mail), badge counts for new messages, principal ID display, and logout functionality.",
  "frontend/src/components/admin/panels/CharactersPanel.tsx": "Admin panel for managing characters with full CRUD operations, supporting bulk-add via a multi-entry form and individual edit/delete via modals and alert dialogs.",
  "frontend/src/components/admin/panels/ClansPanel.tsx": "Admin panel for viewing and editing clan records (name, symbol, description, color) via a modal form, using static clan data as fallback alongside fetched data.",
  "frontend/src/components/admin/panels/ContactMessagesPanel.tsx": "Admin panel that lists contact form submissions with expandable message rows, status badge display, inline status update buttons, and delete confirmation dialogs.",
  "frontend/src/components/admin/panels/EpisodesPanel.tsx": "Admin panel for managing episodes with add/edit/delete functionality, a modal form for episode details (title, summary, status, thumbnail, video link), and status color-coded badges.",
  "frontend/src/components/admin/panels/FanMailPanel.tsx": "Admin panel for viewing fan mail entries with expandable rows, inline status selectors (new/read/replied), and delete confirmation dialogs.",
  "frontend/src/components/admin/panels/GalleryPanel.tsx": "Admin panel component for managing gallery images, supporting add/edit/delete operations with drag-and-drop image upload, category filtering, and a modal form for image metadata.",
  "frontend/src/components/admin/panels/NewsPanel.tsx": "Admin panel component for managing news entries with add/edit/delete functionality, a modal form for title/date/category/body fields, and category badge styling.",
  "frontend/src/components/BadgeCard.tsx": "Renders a badge card with dynamic glow styles based on badge category (rare, clan, character) and locked state, showing an icon, name, and description with optional shimmer effects.",
  "frontend/src/components/BadgeUnlockToast.tsx": "Displays an animated slide-in toast notification when a badge is unlocked, with accent colors and effects based on badge category, auto-dismissing after 5 seconds.",
  "frontend/src/components/Characters.tsx": "Fetches and displays a staggered-animated grid of characters, each showing avatar initials, name, role, bio, and clan badge with clan-specific glow colors.",
  "frontend/src/components/Clans.tsx": "Renders a staggered-animated grid of clan cards using static clan data, each displaying an emblem image, element, name, tagline, and description with clan-specific glow effects.",
  "frontend/src/components/Episodes.tsx": "Fetches and displays a sorted, staggered-animated list of episodes with status badges (Released, Coming Soon, In Production), episode number, title, summary, and duration.",
  "frontend/src/components/FloatingDonateButton.tsx": "A floating donate button that navigates to the /donate route, hidden on the /donate and /admin pages.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, smooth-scroll navigation links, social media icons, and conditionally shows an admin link when the authenticated user is an admin.",
  "frontend/src/components/Gallery.tsx": "Displays a filterable image gallery that merges static and backend-fetched images, supports a lightbox view, and provides admin-only upload functionality via a modal.",
  "frontend/src/components/GalleryUploadModal.tsx": "A modal form that allows admins to upload gallery images by file drag-and-drop or URL, with title/alt-text/category fields, and submits the image to the backend via a mutation hook.",
  "frontend/src/components/Hero.tsx": "Renders the full-screen hero section with a particle canvas, parallax mouse effect, layered background visuals, and animated title text with scroll-to-section buttons.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with smooth-scroll section links, an active-section indicator, mobile menu, and buttons for the quiz and contact pages, with scroll-based styling changes.",
  "frontend/src/components/News.tsx": "Displays a sorted list of news entries fetched from the backend, rendering each as a styled card with a category badge, date, title, and body using staggered fade-in animations.",
  "frontend/src/components/quiz/BalanceUnlockAnimation.tsx": "Animated reveal component for the rare 'Balance' quiz result, displaying burst rings, sparkles, and a shimmer text message across timed phases.",
  "frontend/src/components/quiz/ClanPersonalityQuiz.tsx": "Main clan personality quiz component managing quiz phases (intro, questions, results), score accumulation, clan result calculation, and badge unlock logic with toast notifications.",
  "frontend/src/components/quiz/QuizResultCard.tsx": "Displays the quiz result card for a matched clan with animated entrance, clan-themed glow styling, special Balance clan visuals, and a copy-to-clipboard share feature.",
  "frontend/src/components/ScrollProgressBar.tsx": "Renders a fixed progress bar that tracks and reflects the user's vertical scroll position as a percentage of the total scrollable page height.",
  "frontend/src/components/WorldMap.tsx": "Renders an interactive world map image with clickable hotspot markers for each location, opening a lore modal on click with scroll-triggered fade-in for the section.",
  "frontend/src/components/WorldMapLoreModal.tsx": "A portal-rendered modal that displays detailed lore, clan affiliation, and location info for a selected world map location, with keyboard (Escape) and backdrop close support.",
  "frontend/src/data/badges.ts": "Defines the Badge type and full list of badges across character match, clan loyalty, and rare/secret categories, each with unlock rules or required IDs.",
  "frontend/src/data/characters.ts": "Defines the Character interface and exports an array of six named characters (protagonist, ally, rival, mentor, antagonist, healer) with clan affiliations, roles, and bios.",
  "frontend/src/data/clanDescriptions.ts": "Defines ClanResultData interface and exports a record mapping five ClanIds (moon, fire, water, sun, balance) to their quiz result display data including descriptions, glow colors, icons, and taglines.",
  "frontend/src/data/clans.ts": "Defines the Clan interface and exports an array of seven clans (moon, sun, fire, water, lightning, earth, balance) with element types, descriptions, glow colors, icons, and symbols.",
  "frontend/src/data/episodes.ts": "Defines the Episode interface and exports an array of eight Season 1 episodes with titles, summaries, durations, and release statuses (Released, Coming Soon, In Production).",
  "frontend/src/data/gallery.ts": "Defines GalleryImage and GalleryCategory types and exports a single gallery image entry along with the list of available category filters.",
  "frontend/src/data/news.ts": "Defines the NewsEntry interface and exports five news entries covering episode announcements, dev logs, and season updates with dates and body text.",
  "frontend/src/data/quizQuestions.ts": "Defines quiz types (ClanId, QuizAnswer, QuizQuestion) and exports an array of personality quiz questions with weighted answers that map to clan affinities for determining a user's clan.",
  "frontend/src/data/worldMap.ts": "Defines WorldMapLocation interface and exports an array of named map locations with clan affiliations, lore descriptions, landmarks, glow colors, and percentage-based positions for rendering on a world map.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useBadgeUnlockLogic.ts": "Evaluates quiz results to determine which badges a user has earned, checking for character matches, clan matches, and special trait-score conditions like balance, eclipse, stormheart, and wild card.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useParallax.ts": "Returns a ref that applies a CSS translateY parallax scroll effect to the attached element, disabled on touch devices and when reduced motion is preferred.",
  "frontend/src/hooks/useParticles.ts": "Manages an animated canvas particle system with floating colored particles and connecting lines, returning a canvas ref for attachment to a DOM element.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for all backend interactions including user profiles, badges, contact messages, fan mail, episodes, gallery, characters, clans, and news entries.",
  "frontend/src/hooks/useScrollFadeIn.ts": "Returns a ref and visibility boolean that triggers a fade-in when the attached element enters the viewport using IntersectionObserver.",
  "frontend/src/hooks/useStaggeredFadeIn.ts": "Provides staggered fade-in visibility state for a list of elements using IntersectionObserver, with configurable delay between each item's appearance.",
  "frontend/src/index.css": "Global stylesheet importing fonts and Tailwind, defining CSS custom properties for the design system, and declaring custom animations for badges, gallery buttons, and the donate button.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin.tsx": "Admin page component that gates access by checking authentication and admin status, rendering a login screen, loading spinner, access denied view, or the admin dashboard accordingly.",
  "frontend/src/pages/AdminLogin.tsx": "Renders the admin login page with an Internet Identity authentication button, animated background particles, and a restricted-access notice card.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact page with four themed sections (support, casting, business, supporters), a fan mail form, and social media links, using scroll-based fade-in animations.",
  "frontend/src/pages/Donation.tsx": "Shows a donation/support page listing five tiered supporter levels with perks, a Cash App payment link, and a styled card over a background image.",
  "frontend/src/pages/ProfilePage.tsx": "Renders the authenticated user's profile page with clan-themed styling, editable username/avatar/clan fields, and a badge collection display.",
  "frontend/src/pages/QuizPage.tsx": "Wraps the ClanPersonalityQuiz component in a full-page layout with a sticky header, ambient background glows, scroll progress bar, and a footer.",
  "frontend/src/pages/QuizResultPage.tsx": "Displays the user's clan quiz results derived from their saved profile, unlocks earned badges, and shows toast notifications for newly unlocked badges.",
  "frontend/src/utils/clanScoring.ts": "Provides functions to calculate which clan a quiz taker belongs to based on accumulated scores, including an 8% chance to unlock the rare Balance Clan when the top four clan scores are within 25% of each other. Also exports a normalizeScores function to convert raw scores to a 0–100 scale.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both standard query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark fantasy theme with custom OKLCH colors, clan-specific glow shadows, custom fonts (Cinzel, Rajdhani), and animation keyframes for UI effects.",
  "project_state.json": "Tracks the project state for the WhispersoftheWhiteMoon site, listing existing features, pending feature requests (characters page, bulk character creation, batch API), and architectural notes about the clan-based character system."
}