{
  "backend/main.mo": "Main Motoko actor defining data types (Episode, Character, NewsEntry, GalleryImage, Clan, UserProfile) and CRUD endpoints for a fan site backend, with access-control mixins, blob storage, and badge unlock logic for authenticated users.",
  "backend/migration.mo": "Migration module that converts stored UserProfile records from the old format (unlockedBadges as array) to the new format (unlockedBadges as List) during canister upgrades.",
  "feature_evidence.json": "Feature evidence report listing three planned features: expanding badge static data, adding badge unlock logic to the quiz result flow, and displaying earned badges on the profile page, each with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary catalog describing the purpose and key details of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes used throughout the application.",
  "frontend/index.html": "HTML shell entry point for the Vite/React app with the page title set to 'Whispers Of The White Moon' and a root div for React mounting.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with routes for home, admin, donate, profile, and quiz-result pages, wrapped in a React Query provider.",
  "frontend/src/components/About.tsx": "About section component rendering the story synopsis in alternating slide-in paragraphs and three story-pillar cards with scroll-triggered fade-in animations.",
  "frontend/src/components/admin/AccessDenied.tsx": "Displays a styled 'Access Denied' page for users without admin privileges, featuring an icon, message, and a link back to the home page.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin dashboard layout with a sidebar navigation for managing Episodes, Characters, News, Gallery, and Clans panels. Includes principal ID display with copy functionality and a logout button.",
  "frontend/src/components/admin/panels/CharactersPanel.tsx": "Admin panel for managing characters with full CRUD operations, including a modal form for creating/editing character fields (name, clan, role, bio, initials) and delete confirmation dialogs.",
  "frontend/src/components/admin/panels/ClansPanel.tsx": "Admin panel for viewing and editing clans (no add/delete), with a modal form for updating clan name, symbol, description, and primary color.",
  "frontend/src/components/admin/panels/EpisodesPanel.tsx": "Admin panel for managing episodes with add/edit/delete support, featuring a modal form with fields for title, summary, number, duration, status, thumbnail URL, and video link.",
  "frontend/src/components/admin/panels/GalleryPanel.tsx": "Admin panel for managing gallery images with CRUD operations, supporting drag-and-drop or file-input image uploads alongside fields for title, alt text, category, and image path.",
  "frontend/src/components/admin/panels/NewsPanel.tsx": "Admin panel for managing news entries with add/edit/delete functionality, using a modal form with fields for title, date, category, and body content.",
  "frontend/src/components/BadgeCard.tsx": "Renders a badge card with dynamic glow styles based on badge category (rare, clan, character) and locked state, showing an icon, name, and description with optional shimmer effects.",
  "frontend/src/components/BadgeUnlockToast.tsx": "Displays an animated slide-in toast notification when a badge is unlocked, with accent colors and effects based on badge category, auto-dismissing after 5 seconds.",
  "frontend/src/components/Characters.tsx": "Fetches and displays a staggered-animated grid of characters, each card showing avatar initials, name, role, bio, and clan badge with clan-specific glow colors.",
  "frontend/src/components/Clans.tsx": "Renders a staggered-animated grid of clan cards from static data, each showing a clan emblem image, name, element, tagline, and description with clan-specific glow effects.",
  "frontend/src/components/Episodes.tsx": "Fetches and displays a sorted, staggered-animated list of episodes with status badges (Released, Coming Soon, In Production), episode number, title, summary, and duration.",
  "frontend/src/components/FloatingDonateButton.tsx": "A floating donate button that navigates to the /donate route, hidden on the /donate and /admin pages.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, smooth-scroll navigation links, social media icons, and a conditional admin link shown only to authenticated admin users.",
  "frontend/src/components/Gallery.tsx": "Displays a filterable image gallery merging static and backend-fetched images, with lightbox support, staggered fade-in animations, and an admin-only upload button.",
  "frontend/src/components/GalleryUploadModal.tsx": "Modal form for admins to upload new gallery images via file drag-and-drop or URL input, submitting the data to the backend using a mutation hook.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a particle canvas, parallax mouse-move effect, layered background visuals, and animated title text for the anime series landing page.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with smooth-scroll links, active section highlighting via IntersectionObserver, a sliding indicator, and a mobile hamburger menu.",
  "frontend/src/components/News.tsx": "Displays a sorted list of news entries fetched via a query hook, rendering each as a styled card with a category badge and date. Supports staggered fade-in animations and a loading spinner.",
  "frontend/src/components/ScrollProgressBar.tsx": "Renders a fixed progress bar that tracks the user's scroll position as a percentage of the total scrollable document height.",
  "frontend/src/components/WorldMap.tsx": "Displays an interactive world map image with clickable hotspot markers for each location, opening a lore modal on click. Includes a scroll-triggered fade-in animation for the section.",
  "frontend/src/components/WorldMapLoreModal.tsx": "A portal-rendered modal that shows lore details for a selected world map location, including clan affiliation, description, and styled accents using the location's glow color. Supports Escape key and backdrop-click dismissal.",
  "frontend/src/data/badges.ts": "Defines Badge types and a list of badge objects across three categories (character match, clan loyalty, rare/secret), each with metadata like icon, description, and unlock rules.",
  "frontend/src/data/characters.ts": "Defines the Character interface and exports an array of six named characters, each with clan affiliation, role, title, bio, and initials.",
  "frontend/src/data/clans.ts": "Defines the Clan interface and exports an array of seven elemental clans with visual styling properties (glow colors, icon paths) and lore metadata.",
  "frontend/src/data/episodes.ts": "Defines the Episode interface and exports eight Season 1 episodes with titles, summaries, release statuses, and durations.",
  "frontend/src/data/gallery.ts": "Defines gallery image types and exports a single gallery image entry along with the list of available gallery categories.",
  "frontend/src/data/news.ts": "Defines the NewsEntry interface and exports five news articles with dates, categories, and body text covering episode announcements, dev logs, and season updates.",
  "frontend/src/data/worldMap.ts": "Defines WorldMapLocation interface and exports an array of named map locations, each with clan affiliation, lore description, landmark, glow color, and x/y position.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an authenticated or anonymous backend actor using Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useBadgeUnlockLogic.ts": "Evaluates quiz results to determine which badges a user has earned, checking for character matches, clan matches, and special trait-score conditions like balance, eclipse, stormheart, and wild card.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions and status flags.",
  "frontend/src/hooks/useParallax.ts": "Returns a ref that applies a CSS translateY parallax scroll effect to a div, disabled on touch devices and when reduced motion is preferred.",
  "frontend/src/hooks/useParticles.ts": "Manages an animated canvas particle system with floating colored dots and connecting lines, returning a canvas ref for use in components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, badges, episodes, gallery images, characters, news, and clans via a canister actor.",
  "frontend/src/hooks/useScrollFadeIn.ts": "Returns a ref and visibility boolean that triggers a fade-in when the referenced element enters the viewport using IntersectionObserver.",
  "frontend/src/hooks/useStaggeredFadeIn.ts": "Provides staggered fade-in visibility state for a list of elements using IntersectionObserver, with each item appearing after a configurable delay.",
  "frontend/src/index.css": "Global stylesheet importing fonts and Tailwind, defining CSS custom properties, scrollbar styles, and keyframe animations for badges, gallery buttons, and a floating donate button.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin.tsx": "Admin page component that conditionally renders a login screen, loading spinner, access denied view, or the admin dashboard based on authentication and admin status.",
  "frontend/src/pages/AdminLogin.tsx": "Renders the admin login page with an Internet Identity authentication button, decorative background effects, and a restricted-access notice. Handles login state and errors via the useInternetIdentity hook.",
  "frontend/src/pages/Donation.tsx": "Displays a donation/support page listing five supporter tiers (Moon Clan through Legendary Balance) with perks, styled cards, and a Ko-fi donation link. Uses a background image with overlay and a back-navigation button.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the authenticated user's profile including avatar, clan theme, badges, and an edit modal for updating username, avatar URL, and clan. Fetches and saves profile data via React Query hooks and renders unlocked badges grouped by category.",
  "frontend/src/pages/QuizResultPage.tsx": "Displays the user's quiz result (matched clan and character) derived from their saved profile, unlocks newly earned badges on mount, and shows toast notifications for each new badge. Redirects unauthenticated users to a login prompt.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive parameters from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark fantasy theme with custom colors (void, moon-blue, gold, ember, storm-purple), fonts (Cinzel, Rajdhani), glow box shadows, and keyframe animations like shimmer, pulse-glow, float, and gallery effects.",
  "project_state.json": "Project state tracker describing a quiz/personality matching app with characters, clans, and a 13-badge system (character match, clan loyalty, rare/secret), including feature IDs, architectural notes, and known issues around Internet Identity profile persistence."
}