{
  "backend/main.mo": "Main Motoko actor defining the backend canister with data types (Episode, Character, NewsEntry, GalleryImage, Clan, UserProfile) and CRUD operations for each, protected by role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the 'Built with ♥ using caffeine.ai' attribution text was removed from the frontend Footer component, with high confidence and linked to test REQ-57.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of every frontend source file, describing the purpose and key implementation details of each component, hook, page, and config file.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the application.",
  "frontend/index.html": "HTML shell for the Vite/React app with the page title set to 'Whispers Of The White Moon' and a single root div mounting point.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with routes for home, admin, and donate pages, wraps everything in React Query, and renders FloatingDonateButton globally via RootLayout.",
  "frontend/src/components/About.tsx": "About section component rendering the story synopsis with alternating slide-in paragraph animations, scroll-triggered fade-in heading, and three story-pillar cards (World, Conflict, Prophecy).",
  "frontend/src/components/admin/AccessDenied.tsx": "Renders a styled 'Access Denied' page with a shield icon, error message, and a link back to the home page for users without admin privileges.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard layout with a sidebar navigation (Episodes, Characters, News, Gallery, Clans), logout functionality, and a principal ID display/copy card.",
  "frontend/src/components/admin/panels/CharactersPanel.tsx": "Admin panel for managing characters with add, edit, and delete operations, including a modal form with fields for name, initials, clan, role, and bio.",
  "frontend/src/components/admin/panels/ClansPanel.tsx": "Admin panel for editing existing clans, providing a modal form with fields for name, symbol, description, and primary color.",
  "frontend/src/components/admin/panels/EpisodesPanel.tsx": "Admin panel for managing episodes with add, edit, and delete support, using a modal form with fields for title, summary, number, duration, status, thumbnail URL, and video link.",
  "frontend/src/components/admin/panels/GalleryPanel.tsx": "Admin panel for managing gallery images with add, edit, and delete operations, supporting drag-and-drop or file input for image uploads alongside title, alt text, and category fields.",
  "frontend/src/components/admin/panels/NewsPanel.tsx": "Admin panel component for managing news entries, providing UI for creating, editing, and deleting news items with category badges and a modal form.",
  "frontend/src/components/Characters.tsx": "Characters section that fetches characters from the backend and renders them in a staggered-fade-in grid with clan-colored avatar glows and hover effects derived from the clans data array.",
  "frontend/src/components/Clans.tsx": "Renders the 'Seven Clans' section with a staggered fade-in grid of clan cards, each showing an emblem, element, name, tagline, description, and dynamic glow effects based on clan color.",
  "frontend/src/components/Episodes.tsx": "Fetches and displays a sorted list of anime episodes with staggered fade-in animations, showing each episode's number, title, summary, duration, and a status badge (Released, Coming Soon, In Production).",
  "frontend/src/components/FloatingDonateButton.tsx": "Renders a floating 'Donate' button that navigates to the /donate route, hidden on the /donate and /admin pages.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, smooth-scroll navigation links, social media icons, and a conditionally shown admin link for authenticated admin users.",
  "frontend/src/components/Gallery.tsx": "Displays a filterable image gallery merging static and backend images, with a lightbox viewer, staggered fade-in, and an upload button visible only to authenticated admins.",
  "frontend/src/components/GalleryUploadModal.tsx": "A modal form for uploading new gallery images, supporting drag-and-drop or file input, with fields for title, alt text, category, and optional image URL, submitting via the addGalleryImage mutation.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with layered visual effects (gradient, parallax background image, noise, scanlines, particles) and animated title reveal for the anime series landing page.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with smooth-scroll links, active section tracking via IntersectionObserver, a sliding underline indicator, and a responsive mobile menu.",
  "frontend/src/components/News.tsx": "News section that fetches and displays sorted news entries from the backend with category badges, dates, and staggered fade-in animations.",
  "frontend/src/components/ScrollProgressBar.tsx": "Thin fixed progress bar that reflects the user's scroll position as a percentage of the total page height.",
  "frontend/src/components/WorldMap.tsx": "Interactive world map section that renders clickable hotspot markers over a map image and opens a lore modal when a location is selected.",
  "frontend/src/components/WorldMapLoreModal.tsx": "Portal-based modal that displays lore details, clan affiliation, and points of interest for a selected world map location, with keyboard and backdrop dismiss support.",
  "frontend/src/data/characters.ts": "Defines the Character interface and exports a static array of six main characters, each linked to a clan with role, title, bio, and initials.",
  "frontend/src/data/clans.ts": "Defines the Clan interface and exports a static array of seven elemental clans with display metadata including colors, icon paths, symbols, and descriptions.",
  "frontend/src/data/episodes.ts": "Defines the Episode interface and exports a static array of eight Season 1 episodes with titles, summaries, release statuses, and durations.",
  "frontend/src/data/gallery.ts": "Defines gallery types and exports a static list of gallery images and available category filters for the gallery feature.",
  "frontend/src/data/news.ts": "Defines the NewsEntry interface and exports a static array of five news entries with categories, dates, and body text.",
  "frontend/src/data/worldMap.ts": "Defines the WorldMapLocation interface and exports a static array of named map locations with clan affiliations, lore descriptions, landmarks, glow colors, and positions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useParallax.ts": "React hook that applies a CSS translateY parallax scroll effect to a referenced div element, disabled on touch devices and when reduced motion is preferred.",
  "frontend/src/hooks/useParticles.ts": "React hook that renders an animated canvas particle system with colored floating particles and connecting lines between nearby particles.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend actor calls including user profiles, episodes, gallery images, characters, news, and clans with corresponding CRUD mutations.",
  "frontend/src/hooks/useScrollFadeIn.ts": "React hook that uses IntersectionObserver to trigger a fade-in visibility state when the referenced element scrolls into view.",
  "frontend/src/hooks/useStaggeredFadeIn.ts": "React hook that staggered-animates multiple elements into view using IntersectionObserver, with configurable per-item delay and reduced-motion support.",
  "frontend/src/index.css": "Global stylesheet defining the OKLCH color system, Tailwind base imports, custom CSS tokens, and component styles for navbar, scroll progress bar, and logo animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin.tsx": "Admin page component that gates access behind Internet Identity authentication and an admin role check, rendering login, loading, access-denied, or dashboard states accordingly.",
  "frontend/src/pages/AdminLogin.tsx": "Renders the admin login page with an Internet Identity authentication button, decorative background particles, and a restricted-access notice card styled with the site's dark glassmorphism theme.",
  "frontend/src/pages/Donation.tsx": "Displays a donation/support page listing five tiered supporter levels (Moon Clan through Legendary Balance) with perks, styled over a background image with a dark overlay and glassmorphism card.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the project's custom color palette (void, moon-blue, gold, ember, etc.), custom fonts (Cinzel, Rajdhani), glow box-shadows, and keyframe animations used across the site.",
  "project_state.json": "Tracks the overall project state (version 39) for the 'Whispers Of The White Moon' anime site, documenting architectural notes, existing features, and known issues for build planning purposes."
}