{
  "backend/main.mo": "Main Motoko actor defining all data types (Episode, Character, NewsEntry, GalleryImage, Clan, UserProfile, ContactMessage, FanMail) and public/query methods for content management, contact/fan mail submission, and admin retrieval, with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that upgrades old ContactMessage and FanMail records (lacking a status field) to new versions by adding a default `#new` status, preserving all other actor state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping planned feature IDs to their target files, related components, and test IDs, covering React Query hooks, ContactMessagesPanel, FanMailPanel, and AdminDashboard integration.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering components, hooks, pages, styles, and configuration files in the React frontend.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based design tokens for light and dark themes, including color variables for backgrounds, borders, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to \"Whispers Of The White Moon\" and mounting the React root at `#root`.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with routes for home, admin, donate, profile, quiz, quiz-result, and contact pages, wrapped in a React Query provider.",
  "frontend/src/components/About.tsx": "Renders the 'About' section with story paragraphs that slide in on scroll and three story-pillar cards (World, Conflict, Prophecy) with fade-in animations.",
  "frontend/src/components/admin/AccessDenied.tsx": "Displays a styled 'Access Denied' screen with an icon and message for users lacking admin privileges, including a link back to the home page.",
  "frontend/src/components/admin/AdminDashboard.tsx": "The main admin dashboard layout with a sidebar navigation for managing episodes, characters, news, gallery, clans, contact messages, and fan mail, including unread badge counts and logout functionality.",
  "frontend/src/components/admin/panels/CharactersPanel.tsx": "Admin panel for managing characters with full CRUD operations, including a modal form for creating/editing characters with fields for name, initials, clan, role, and bio.",
  "frontend/src/components/admin/panels/ClansPanel.tsx": "Admin panel for viewing and editing clan data (name, symbol, description, primary color) via a modal form, supporting only updates (no add/delete).",
  "frontend/src/components/admin/panels/ContactMessagesPanel.tsx": "Admin panel that lists contact form submissions with expandable message rows, status badge display, inline status updates (new/read/replied), and delete confirmation dialogs.",
  "frontend/src/components/admin/panels/EpisodesPanel.tsx": "Admin panel for managing episodes with add/edit/delete functionality, a modal form covering title, summary, number, duration, status, thumbnail URL, and video link fields.",
  "frontend/src/components/admin/panels/FanMailPanel.tsx": "Admin panel for viewing fan mail entries with expandable rows, inline status selectors (new/read/replied), and delete confirmation dialogs, mirroring the ContactMessagesPanel structure.",
  "frontend/src/components/admin/panels/GalleryPanel.tsx": "Admin panel component for managing gallery images, supporting add/edit/delete operations with drag-and-drop image upload, category filtering, and a modal form for image metadata.",
  "frontend/src/components/admin/panels/NewsPanel.tsx": "Admin panel component for managing news entries with add/edit/delete functionality, a modal form with title/date/category/body fields, and category badge styling.",
  "frontend/src/components/BadgeCard.tsx": "Displays a single badge as a styled card with dynamic glow colors based on badge category (rare, clan, character), showing a lock overlay and grayscale effect for locked badges.",
  "frontend/src/components/BadgeUnlockToast.tsx": "Shows an animated slide-in toast notification when a badge is unlocked, with accent colors and shimmer effects varying by badge category, auto-dismissing after 5 seconds.",
  "frontend/src/components/Characters.tsx": "Fetches and renders a staggered grid of character cards, each styled with clan-specific glow colors and displaying the character's avatar initials, name, role, bio, and clan badge.",
  "frontend/src/components/Clans.tsx": "Renders a staggered grid of clan cards using static clan data, each showing the clan emblem image, element, name, tagline, description, and a dynamic glow effect on hover.",
  "frontend/src/components/Episodes.tsx": "Fetches and displays a sorted list of episodes with staggered fade-in animations, showing each episode's number, title, status badge (Released/Coming Soon/In Production), summary, and duration.",
  "frontend/src/components/FloatingDonateButton.tsx": "A floating donate button component that navigates to '/donate' and is hidden on the donate and admin routes.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, smooth-scroll navigation links, social icons, and a conditional admin link shown only to authenticated admins.",
  "frontend/src/components/Gallery.tsx": "Gallery section that merges static and backend images, supports category filtering and lightbox view, and exposes an upload button for authenticated admins.",
  "frontend/src/components/GalleryUploadModal.tsx": "Modal form for uploading gallery images via drag-and-drop or file input, supporting title, alt text, category, and optional URL, then submitting to the backend.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with layered backgrounds, particle canvas, parallax mouse effect, animated title reveal, and scroll/navigate CTAs.",
  "frontend/src/components/Navbar.tsx": "Fixed top navbar with smooth-scroll section links, active-section indicator, mobile menu, and buttons for the quiz and contact pages.",
  "frontend/src/components/News.tsx": "Displays a sorted list of news entries fetched from the backend, rendering each as a styled card with a category badge, date, title, and body using staggered fade-in animations.",
  "frontend/src/components/quiz/BalanceUnlockAnimation.tsx": "Animated reveal component for the rare 'Balance' quiz result, displaying burst rings, sparkles, and a shimmer text message across timed phases.",
  "frontend/src/components/quiz/ClanPersonalityQuiz.tsx": "Multi-phase clan personality quiz component that scores user answers, calculates a clan result, handles badge unlocking via Internet Identity authentication, and renders result cards with toast notifications.",
  "frontend/src/components/quiz/QuizResultCard.tsx": "Displays the quiz result card for a matched clan with animated entrance, clan-themed or Balance-specific glow/shimmer styling, and a copy-to-clipboard share feature.",
  "frontend/src/components/ScrollProgressBar.tsx": "Renders a fixed progress bar that tracks and reflects the user's scroll position as a percentage of the total scrollable page height.",
  "frontend/src/components/WorldMap.tsx": "Displays an interactive world map image with clickable hotspot markers for each location, opening a lore modal when a marker is selected.",
  "frontend/src/components/WorldMapLoreModal.tsx": "A portal-rendered modal that shows detailed lore, clan affiliation, and location info for a selected world map location, with keyboard and backdrop close support.",
  "frontend/src/data/badges.ts": "Defines the Badge type and a static array of all badges including character match, clan loyalty, and rare/secret badges with their unlock rules and metadata.",
  "frontend/src/data/characters.ts": "Defines the Character interface and exports an array of six named characters (protagonist, ally, rival, mentor, antagonist, healer) with clan affiliations, roles, and bios.",
  "frontend/src/data/clanDescriptions.ts": "Defines ClanResultData interface and exports a record mapping five ClanIds (moon, fire, water, sun, balance) to their quiz result display data including glow colors, icons, and taglines.",
  "frontend/src/data/clans.ts": "Defines the Clan interface and exports an array of seven clans (moon, sun, fire, water, lightning, earth, balance) with element types, descriptions, glow colors, and icon paths.",
  "frontend/src/data/episodes.ts": "Defines the Episode interface with release status types and exports an array of eight Season 1 episodes with titles, summaries, durations, and release statuses.",
  "frontend/src/data/gallery.ts": "Defines GalleryImage and GalleryCategory types and exports a single gallery image entry along with the list of available category filters.",
  "frontend/src/data/news.ts": "Defines the NewsEntry interface and exports five news entries covering episode announcements, dev logs, and season updates with dates and body text.",
  "frontend/src/data/quizQuestions.ts": "Defines quiz types (ClanId, QuizQuestion, QuizAnswer) and exports an array of questions where each answer carries weighted scores toward one of five clan outcomes.",
  "frontend/src/data/worldMap.ts": "Defines WorldMapLocation interface and exports an array of named map locations with clan affiliations, lore descriptions, landmarks, glow colors, and percentage-based positions.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBadgeUnlockLogic.ts": "Evaluates quiz results to determine which badges a user has earned, checking for character matches, clan matches, and special trait-score conditions like balance, eclipse, stormheart, and wild card.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions and status flags.",
  "frontend/src/hooks/useParallax.ts": "Returns a ref that applies a CSS translateY parallax scroll effect to a div, disabled on touch devices and when reduced motion is preferred.",
  "frontend/src/hooks/useParticles.ts": "Manages an animated canvas particle system with floating colored dots and connecting lines, returning a ref to attach to a canvas element.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for all backend interactions including user profiles, badges, contact messages, fan mail, episodes, gallery, characters, clans, and news entries.",
  "frontend/src/hooks/useScrollFadeIn.ts": "Returns a ref and visibility boolean that triggers a fade-in when the referenced element enters the viewport using IntersectionObserver.",
  "frontend/src/hooks/useStaggeredFadeIn.ts": "Provides staggered fade-in visibility state for a list of elements using IntersectionObserver, with each item appearing after a configurable delay offset.",
  "frontend/src/index.css": "Global stylesheet importing Tailwind and Google Fonts, defining CSS custom properties, scrollbar styles, and keyframe animations for badges, gallery buttons, and the donate button.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin.tsx": "Admin page component that conditionally renders a login screen, loading spinner, access denied view, or the admin dashboard based on authentication and admin status.",
  "frontend/src/pages/AdminLogin.tsx": "Renders the admin login page with Internet Identity authentication, featuring a styled card with animated background particles, a Moon icon logo, and a login button that triggers the II login flow.",
  "frontend/src/pages/ContactPage.tsx": "Displays the contact page with four themed sections (support, casting, business, supporters), a fan mail form, and social media links, using staggered fade-in animations and backend mutation hooks for form submission.",
  "frontend/src/pages/Donation.tsx": "Shows a donation/supporter page with five tiered supporter levels (Moon Clan through Legendary Balance), each listing perks and styled with unique glow colors, over a background image with a dark overlay.",
  "frontend/src/pages/ProfilePage.tsx": "Renders the authenticated user's profile page with clan-themed styling, editable username/avatar/clan fields, and a badge collection display using data from backend query hooks.",
  "frontend/src/pages/QuizPage.tsx": "Wraps the ClanPersonalityQuiz component in a full-page layout with a sticky header, ambient background glows, scroll progress bar, and a footer.",
  "frontend/src/pages/QuizResultPage.tsx": "Displays the clan/character quiz results derived from the user's saved profile, handles badge unlocking for newly earned badges, and shows toast notifications for unlocked badges.",
  "frontend/src/utils/clanScoring.ts": "Provides functions to calculate and normalize clan quiz scores, including a rare 8% 'Balance Clan' unlock when the top four clan scores are within 25% of each other.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear values via sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark fantasy theme with custom OKLCH colors, fonts (Cinzel, Rajdhani), glow box shadows, and keyframe animations like shimmer, float, and map-pulse.",
  "project_state.json": "Tracks the project's current state including architectural notes, existing features (admin panels for contact messages and fan mail), and new feature requests for a website with an Admin Panel, Contact Page, and Fan Mail section."
}