{
  "backend/main.mo": "Main Motoko actor defining data types (Episode, Character, NewsEntry, GalleryImage, Clan, UserProfile) and CRUD endpoints for each, with access control enforcing admin/user permissions and a migration hook.",
  "backend/migration.mo": "Migration module that transforms the old UserProfile schema (name, email) into the new schema (username, avatarUrl, matchedClanId, matchedCharacterId, unlockedBadges) for all stored principals.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (profile page, clan theming, badges, navbar profile link, etc.) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Auto-generated JSON dictionary providing one-line descriptions of every frontend source file, serving as a reference index for the project's React components, hooks, data files, and configuration.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, sidebar, and chart tokens.",
  "frontend/index.html": "HTML shell with the page title set to 'Whispers Of The White Moon' and a single root div that mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for home, /admin, /donate, and /profile (ProfilePage), wrapped in a React Query provider.",
  "frontend/src/components/About.tsx": "Story section component with scroll-triggered slide-in paragraphs, a glowing section heading, and three story-pillar cards rendered in a responsive grid.",
  "frontend/src/components/admin/AccessDenied.tsx": "A full-screen access denied page shown when a user lacks admin privileges, displaying an error message and a link to return home.",
  "frontend/src/components/admin/AdminDashboard.tsx": "The main admin dashboard layout with a sidebar navigation for managing episodes, characters, news, gallery, and clans, plus a principal ID display and logout functionality.",
  "frontend/src/components/admin/panels/CharactersPanel.tsx": "Admin panel for listing, adding, editing, and deleting characters, with a modal form that includes fields for name, initials, clan, role, and bio.",
  "frontend/src/components/admin/panels/ClansPanel.tsx": "Admin panel for viewing and editing existing clans, with a modal form supporting name, symbol, description, and primary color fields.",
  "frontend/src/components/admin/panels/EpisodesPanel.tsx": "Admin panel for managing episodes with add, edit, and delete operations, featuring a modal form with fields for title, summary, number, duration, status, thumbnail URL, and video link.",
  "frontend/src/components/admin/panels/GalleryPanel.tsx": "Admin panel component for managing gallery images, providing a modal form with drag-and-drop upload, and CRUD operations (add, edit, delete) for gallery entries organized by category.",
  "frontend/src/components/admin/panels/NewsPanel.tsx": "Admin panel component for managing news entries, providing a modal form and CRUD operations (add, edit, delete) for news items with title, date, category, and body fields.",
  "frontend/src/components/Characters.tsx": "Displays a grid of characters fetched from the backend, showing each character's avatar, name, role, bio, and clan badge with clan-specific glow colors and staggered fade-in animations.",
  "frontend/src/components/Clans.tsx": "Renders a grid of the seven clans from static data, displaying each clan's emblem, element, name, tagline, and description with per-clan glow colors and staggered fade-in animations.",
  "frontend/src/components/Episodes.tsx": "Fetches and displays a sorted list of episodes with their number, title, summary, duration, and a status badge (Released, Coming Soon, or In Production) with staggered fade-in animations.",
  "frontend/src/components/FloatingDonateButton.tsx": "A floating action button that navigates to the /donate page, hidden on the /donate and /admin routes.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, navigation links, social icons, and a conditionally shown admin link visible only to authenticated admin users.",
  "frontend/src/components/Gallery.tsx": "Gallery section that merges static and backend images, supports category filtering and a lightbox view, and allows authenticated admins to upload new images via a modal.",
  "frontend/src/components/GalleryUploadModal.tsx": "A modal component for uploading gallery images that supports drag-and-drop or file input, with fields for title, alt text, category, and image URL, submitting via the `useAddGalleryImage` mutation hook.",
  "frontend/src/components/Hero.tsx": "The full-screen hero section with layered backgrounds (gradient, banner image, noise, scanlines, particles), parallax mouse movement, and animated title/CTA elements for the anime series landing page.",
  "frontend/src/components/Navbar.tsx": "A fixed navigation bar with smooth-scroll anchor links, active section highlighting via IntersectionObserver, a sliding indicator, mobile hamburger menu, and an authenticated user icon via Internet Identity.",
  "frontend/src/components/News.tsx": "Displays a sorted list of news/dev-log entries fetched from the backend, with category badges, dates, and staggered fade-in animations.",
  "frontend/src/components/ScrollProgressBar.tsx": "A thin fixed progress bar that tracks and visually reflects the user's scroll position as a percentage of the total page height.",
  "frontend/src/components/WorldMap.tsx": "Renders an interactive world map image with clickable hotspot markers for each location, opening a lore modal on click, with scroll-triggered fade-in animation.",
  "frontend/src/components/WorldMapLoreModal.tsx": "A portal-rendered modal component that displays lore details for a selected world map location, including its name, clan affiliation, description, and notable features, with keyboard/backdrop close support.",
  "frontend/src/data/badges.ts": "Defines the Badge interface and exports a static array of eight badge objects with id, name, icon, and description for user achievements in the Aethoria universe.",
  "frontend/src/data/characters.ts": "Defines the Character interface and exports a static array of six characters with clan associations, roles, titles, bios, and initials, along with a helper to look up clans.",
  "frontend/src/data/clans.ts": "Defines the Clan interface and exports a static array of seven elemental clans with display metadata including colors, icon paths, symbols, and taglines.",
  "frontend/src/data/episodes.ts": "Defines Episode and ReleaseStatus types and exports a static array of eight Season 1 episodes with titles, summaries, release statuses, and durations.",
  "frontend/src/data/gallery.ts": "Defines GalleryImage and GalleryCategory types and exports a static gallery image array and category list for the frontend gallery feature.",
  "frontend/src/data/news.ts": "Defines NewsEntry and NewsCategory types and exports a static array of five news entries covering dev logs, episode announcements, and season updates.",
  "frontend/src/data/worldMap.ts": "Defines the `WorldMapLocation` interface and exports an array of named map locations, each with clan affiliation, lore description, landmark, glow color, and position data for rendering an interactive world map.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage DFINITY AuthClient lifecycle, including login, logout, and persisting identity across page reloads.",
  "frontend/src/hooks/useParallax.ts": "Hook that applies a CSS `translateY` parallax scroll effect to a referenced div element, disabled automatically on touch devices and when the user prefers reduced motion.",
  "frontend/src/hooks/useParticles.ts": "Hook that drives an animated canvas particle system with floating colored dots and connecting lines, resizing and reinitializing on window resize.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for CRUD operations on backend entities (episodes, gallery images, characters, news, clans, user profiles), each wired to the `useActor` hook.",
  "frontend/src/hooks/useScrollFadeIn.ts": "Hook that uses `IntersectionObserver` to set an element visible once it enters the viewport, enabling a scroll-triggered fade-in effect.",
  "frontend/src/hooks/useStaggeredFadeIn.ts": "Hook that observes multiple elements and reveals them sequentially with a configurable stagger delay using `IntersectionObserver`, respecting the reduced-motion preference.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind layers with custom CSS variables for the design system, and defines utility styles for scrollbars, gallery sections, upload/auth buttons, and a floating donate button.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider, then mounts it to the DOM.",
  "frontend/src/pages/Admin.tsx": "Admin page component that gates access by checking authentication and admin status, rendering a login screen, loading spinner, access denied, or the admin dashboard accordingly.",
  "frontend/src/pages/AdminLogin.tsx": "Login page for the admin portal that triggers Internet Identity authentication and displays a styled card with a login button and status feedback.",
  "frontend/src/pages/Donation.tsx": "Donation page displaying five supporter tiers with perks and styled cards, rendered over a background image with a dark overlay.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page that displays and allows editing of a user's profile (username, avatar, clan, character) with clan-themed styling and an edit modal.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark fantasy theme with custom fonts (Cinzel, Rajdhani), OKLCH-based color palette, glow box shadows, and animation keyframes.",
  "project_state.json": "Tracks the project state (version 3) for an anime website with a player profile page, documenting existing features (profile route, clan theming, badges, navbar link) and pending feature requests around persistent user data storage and profile navigation."
}