{
  "kind": "build_request",
  "title": "Allow bulk (multiple) character creation in Admin Panel",
  "projectName": "Whispers of the White Moon",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend character creation API to accept and persist an array of characters in a single call, so admins can create multiple characters at once.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "in the admin panel, when admins make characters...alow them to make mutible"
        ]
      },
      "acceptanceCriteria": [
        "A new public method (e.g., addCharacters) accepts an array of character records and stores all of them.",
        "Individual character creation still works via the existing addCharacter method.",
        "All submitted characters are persisted and retrievable via getCharacters."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the CharactersPanel admin UI to allow adding multiple characters in a single session. The modal form should support adding and removing multiple character entries before submitting, so all entries are saved at once with a single submit action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "in the admin panel, when admins make characters...alow them to make mutible"
        ]
      },
      "acceptanceCriteria": [
        "The 'Add Character' modal displays at least one character form entry by default.",
        "An 'Add Another Character' button appends a new blank character form entry to the modal.",
        "Each character entry has a remove button to delete that entry (disabled when only one entry remains).",
        "Each entry includes all existing fields: name, initials, clan, role, and bio.",
        "Submitting the form saves all character entries at once via the bulk backend method.",
        "Success and error states are communicated clearly to the admin.",
        "After a successful bulk save, the character list is refreshed."
      ]
    }
  ],
  "constraints": [
    "Do not remove or break existing single-character editing (edit/update) functionality in CharactersPanel.",
    "Do not modify any files listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Bulk editing or bulk deleting of existing characters.",
    "CSV or file-based import of characters.",
    "Any changes to the public-facing Characters display component."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}