{
  "kind": "build_request",
  "title": "Implement Badge System (Character Match, Clan Loyalty, Rare/Secret Badges)",
  "projectName": "Whispers Of The White Moon",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the backend UserProfile data type and actor to store a list of unlocked badge IDs per user. Add a backend function `unlockBadge(badgeId: Text)` that appends a badge ID to the caller's profile if not already present, and a function `getUnlockedBadges()` that returns the caller's current list of badge IDs.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Users earn these when they match a character",
          "Unlocked by matching Haruna",
          "These trigger based on the clan result OR majority of answers"
        ]
      },
      "acceptanceCriteria": [
        "UserProfile type includes an `unlockedBadges: [Text]` field",
        "`unlockBadge` adds the given badgeId to the caller's profile without duplicates",
        "`getUnlockedBadges` returns all badge IDs unlocked by the authenticated caller",
        "Unauthenticated calls to `unlockBadge` are rejected"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expand the static badge data in `frontend/src/data/badges.ts` to include all 13 badges: Character Match Badges (Shadow Seer, Wrath Guardian, Memory Keeper, Royal Strategist, Balance King), Clan Loyalty Badges (Moon Clan Initiate, Flame Clan Vanguard, Water Clan Guardian, Sun Clan Noble, Balance Clan Chosen), and Rare/Secret Badges (Eclipse Soul, Stormheart, Wild Card Spirit). Each badge must have: id, name, icon (emoji), tagline/description, category ('character' | 'clan' | 'rare'), and unlock condition metadata (e.g., requiredCharacterId, requiredClanId, or unlockRule for rare badges).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "🌑 Shadow Seer Badge\nUnlocked by matching Haruna\nTagline: \"Master of hidden truths.\"",
          "🔥 Wrath Guardian Badge\nUnlocked by matching Raizen\nTagline: \"Power fueled by loyalty.\"",
          "🌊 Memory Keeper Badge\nUnlocked by matching Selene\nTagline: \"Protector of emotional tides.\"",
          "☀️ Royal Strategist Badge\nUnlocked by matching Valerinon\nTagline: \"Guiding light in chaos.\"",
          "⚖️ Balance King Badge\nUnlocked by rare perfect balance result\nTagline: \"Harmony above all.\"",
          "🌑 Moon Clan Initiate\n🔥 Flame Clan Vanguard\n🌊 Water Clan Guardian\n☀️ Sun Clan Noble\n⚖️ Balance Clan Chosen",
          "🌘 Eclipse Soul\n→ Unlock if someone shows both Sun + Moon traits",
          "🌊🔥 Stormheart\n→ Unlock if Water + Flame traits are high",
          "🎭 Wild Card Spirit\n→ Unlock if answers are evenly spread across everything"
        ]
      },
      "acceptanceCriteria": [
        "All 13 badges are defined in badges.ts with id, name, icon, tagline, category, and unlock condition metadata",
        "Character Match Badges reference the correct character IDs (Haruna, Raizen, Selene, Valerinon)",
        "Clan Loyalty Badges reference the correct clan IDs",
        "Rare badges have unlock rules: Eclipse Soul requires Sun+Moon traits, Stormheart requires Water+Flame traits, Wild Card Spirit requires evenly spread trait scores"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add badge unlock logic to the frontend quiz result flow. After a quiz result is determined, evaluate which badges the user has earned and call the backend `unlockBadge` mutation for each earned badge. Logic must check: (1) Character Match — if the matched character corresponds to a badge, unlock it; (2) Clan Loyalty — if the matched clan or the majority of answers belong to a clan, unlock the corresponding clan badge; (3) Rare/Secret — Eclipse Soul if both Sun and Moon trait scores are high, Stormheart if both Water and Flame trait scores are high, Wild Card Spirit if all trait scores are within a close range of each other. Also unlock Balance King if the quiz result is a perfect balance across all traits.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Users earn these when they match a character",
          "These trigger based on the clan result OR majority of answers",
          "Unlock if someone shows both Sun + Moon traits",
          "Unlock if Water + Flame traits are high",
          "Unlock if answers are evenly spread across everything",
          "Unlocked by rare perfect balance result"
        ]
      },
      "acceptanceCriteria": [
        "After quiz completion, character match badges are automatically evaluated and unlocked if conditions are met",
        "Clan loyalty badges are unlocked based on the resulting clan or majority of answers",
        "Eclipse Soul is unlocked when Sun and Moon trait scores are both above a defined threshold",
        "Stormheart is unlocked when Water and Flame trait scores are both above a defined threshold",
        "Wild Card Spirit is unlocked when all trait scores are within a narrow range (e.g., max difference ≤ 15%)",
        "Balance King is unlocked only on a perfect balance result",
        "`unlockBadge` is called for each newly earned badge when the user is authenticated"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Display earned badges on the user's profile page (`frontend/src/pages/ProfilePage.tsx`). Show a badges section with three sub-sections: Character Match Badges, Clan Loyalty Badges, and Rare & Secret Badges. For each badge, display its icon, name, and tagline. Locked badges should appear dimmed/greyed out with a lock icon overlay so users can see what they haven't earned yet (encouraging re-engagement). Unlocked badges should be visually highlighted with the clan's themed glow color or a golden glow for rare badges.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "These make people want to retake the quiz (huge engagement boost)",
          "🌑 Shadow Seer Badge",
          "🎭 Wild Card Spirit"
        ]
      },
      "acceptanceCriteria": [
        "Profile page shows a Badges section with three categorized sub-sections",
        "All 13 badges are visible on the profile (locked or unlocked)",
        "Unlocked badges display with full color, icon, name, and tagline",
        "Locked badges are visually dimmed with a lock overlay, name shown but tagline optionally hidden or shown as '???'",
        "Rare/Secret badge icons and names are visible when locked to entice users to discover them",
        "Unlocked badges use clan-appropriate or golden glow styling"
      ]
    },
    {
      "id": "REQ-5",
      "text": "After a quiz result is processed and badges are unlocked, display a badge unlock celebration/notification to the user. For each newly earned badge, show a styled toast or modal pop-up with the badge's icon, name, and tagline. Rare badge unlocks should have a more dramatic reveal animation (e.g., shimmer or pulse effect).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "These make people want to retake the quiz (huge engagement boost)"
        ]
      },
      "acceptanceCriteria": [
        "A notification/toast appears for each newly unlocked badge after quiz completion",
        "Notification shows the badge icon, name, and tagline",
        "Rare badge (Eclipse Soul, Stormheart, Wild Card Spirit, Balance King) notifications have a distinct and more dramatic animation",
        "Notifications are dismissible and auto-dismiss after a few seconds"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add a `useUnlockBadge` mutation hook and a `useGetUnlockedBadges` query hook to `frontend/src/hooks/useQueries.ts`, wired to the new backend `unlockBadge` and `getUnlockedBadges` functions respectively.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "`useGetUnlockedBadges` fetches the authenticated user's unlocked badge IDs from the backend",
        "`useUnlockBadge` calls the backend `unlockBadge` function and invalidates the unlocked badges query on success",
        "Both hooks follow the existing patterns in `useQueries.ts`"
      ]
    }
  ],
  "constraints": [
    "All Motoko logic must remain in the single backend/main.mo actor",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Badge unlock logic must only trigger when the user is authenticated via Internet Identity",
    "Locked rare/secret badges must still be visible (name and icon shown) to encourage re-engagement — do not fully hide them"
  ],
  "nonGoals": [
    "Leaderboards or badge comparison between users",
    "Custom badge image assets (emoji icons are sufficient)",
    "Admin panel management of badges",
    "Social sharing of badges",
    "Fixing profile page data persistence / Internet Identity sync issues (separate known issue)"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}