{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement Badge System (Character Match, Clan Loyalty, Rare/Secret Badges)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Expand static badge data to include all 13 badges with metadata",
      "acceptanceCriteria": [
        "All 13 badges are defined in badges.ts with id, name, icon, tagline, category, and unlock condition metadata",
        "Character Match Badges reference the correct character IDs (Haruna, Raizen, Selene, Valerinon)",
        "Clan Loyalty Badges reference the correct clan IDs",
        "Rare badges have unlock rules: Eclipse Soul requires Sun+Moon traits, Stormheart requires Water+Flame traits, Wild Card Spirit requires evenly spread trait scores"
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/badges.ts",
          "operation": "modify",
          "description": "Expand the Badge interface to include category ('character' | 'clan' | 'rare'), tagline, and unlockCondition fields. Add all 13 badges: Character Match Badges (Shadow Seer for Haruna, Wrath Guardian for Raizen, Memory Keeper for Selene, Royal Strategist for Valerinon, Balance King for perfect balance), Clan Loyalty Badges (Moon Clan Initiate, Flame Clan Vanguard, Water Clan Guardian, Sun Clan Noble, Balance Clan Chosen), and Rare/Secret Badges (Eclipse Soul for Sun+Moon traits, Stormheart for Water+Flame traits, Wild Card Spirit for evenly spread traits). Each badge must include its emoji icon, name, tagline, category, and unlock condition metadata (requiredCharacterId, requiredClanId, or unlockRule)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add badge unlock logic to quiz result flow",
      "acceptanceCriteria": [
        "After quiz completion, character match badges are automatically evaluated and unlocked if conditions are met",
        "Clan loyalty badges are unlocked based on the resulting clan or majority of answers",
        "Eclipse Soul is unlocked when Sun and Moon trait scores are both above a defined threshold",
        "Stormheart is unlocked when Water and Flame trait scores are both above a defined threshold",
        "Wild Card Spirit is unlocked when all trait scores are within a narrow range (e.g., max difference ≤ 15%)",
        "Balance King is unlocked only on a perfect balance result",
        "`unlockBadge` is called for each newly earned badge when the user is authenticated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBadgeUnlockLogic.ts",
          "operation": "create",
          "description": "Create a custom hook that evaluates which badges a user has earned based on quiz results. The hook accepts quiz result data (matched character, matched clan, trait scores) and returns an array of earned badge IDs. Logic: (1) Character Match — check if the matched character ID corresponds to a character badge in badges.ts and include its ID; (2) Clan Loyalty — check if the matched clan ID corresponds to a clan badge and include its ID; (3) Rare/Secret — Eclipse Soul if both Sun and Moon trait scores exceed a threshold (e.g., 70%), Stormheart if both Water and Flame trait scores exceed a threshold (e.g., 70%), Wild Card Spirit if the difference between max and min trait scores is within 15%, Balance King if all trait scores are exactly equal. Use the static badges array from badges.ts to look up badge IDs by their unlock conditions."
        },
        {
          "path": "frontend/src/pages/QuizResultPage.tsx",
          "operation": "create",
          "description": "Create a quiz result page that displays the user's matched character and clan, renders the result using clan-themed styling, and triggers badge unlock logic. On mount or result change, call the useBadgeUnlockLogic hook to determine earned badges, then call useUnlockBadge mutation for each newly earned badge (only when the user is authenticated). Track which badges were just unlocked in this session to display celebration notifications. Include a summary of the quiz result with the character bio, clan description, and a CTA to view the full profile or retake the quiz."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display earned badges on the user's profile page",
      "acceptanceCriteria": [
        "Profile page shows a Badges section with three categorized sub-sections",
        "All 13 badges are visible on the profile (locked or unlocked)",
        "Unlocked badges display with full color, icon, name, and tagline",
        "Locked badges are visually dimmed with a lock overlay, name shown but tagline optionally hidden or shown as '???'",
        "Rare/Secret badge icons and names are visible when locked to entice users to discover them",
        "Unlocked badges use clan-appropriate or golden glow styling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Add a Badges section to the profile page below the existing profile card. Fetch the user's unlocked badge IDs using the useGetUnlockedBadges query hook. Import the full badges array from badges.ts and render three sub-sections: Character Match Badges, Clan Loyalty Badges, and Rare & Secret Badges. For each badge in the array, check if its ID is in the unlocked list. If unlocked, display the badge with full color, icon, name, and tagline, styled with a clan-appropriate glow (using the clan's primaryColor from clans.ts) or a golden glow for rare badges. If locked, display the badge dimmed with reduced opacity, a lock icon overlay, and show the name but hide or replace the tagline with '???'. Ensure all 13 badges are visible (locked or unlocked) to encourage re-engagement."
        },
        {
          "path": "frontend/src/components/BadgeCard.tsx",
          "operation": "create",
          "description": "Create a reusable BadgeCard component that accepts a badge object and a locked boolean prop. When locked is false, render the badge with full color, icon, name, and tagline, applying a glow effect (clan-colored or golden for rare badges). When locked is true, render the badge with reduced opacity, a lock icon overlay, and show the name but hide or replace the tagline with '???'. Use Tailwind CSS for styling and apply conditional glow classes based on the badge's category and associated clan or rare status."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Display badge unlock celebration/notification after quiz completion",
      "acceptanceCriteria": [
        "A notification/toast appears for each newly unlocked badge after quiz completion",
        "Notification shows the badge icon, name, and tagline",
        "Rare badge (Eclipse Soul, Stormheart, Wild Card Spirit, Balance King) notifications have a distinct and more dramatic animation",
        "Notifications are dismissible and auto-dismiss after a few seconds"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BadgeUnlockToast.tsx",
          "operation": "create",
          "description": "Create a BadgeUnlockToast component that displays a styled toast notification for a newly unlocked badge. Accept badge object and onDismiss callback as props. Render the badge icon, name, and tagline in a card with a slide-in animation. For rare badges (category 'rare'), apply a more dramatic reveal animation (e.g., shimmer, pulse, or scale effect). Auto-dismiss the toast after 5 seconds using a useEffect timer. Include a close button for manual dismissal. Use Tailwind CSS and keyframe animations for the visual effects."
        },
        {
          "path": "frontend/src/pages/QuizResultPage.tsx",
          "operation": "modify",
          "description": "After determining earned badges and calling useUnlockBadge, render a BadgeUnlockToast component for each newly unlocked badge. Maintain a local state array of toasts to display and remove them after they auto-dismiss or are manually dismissed. Stack multiple toasts vertically in a fixed position (e.g., top-right corner) if the user unlocks multiple badges at once."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add mutation and query hooks for badge operations",
      "acceptanceCriteria": [
        "`useGetUnlockedBadges` fetches the authenticated user's unlocked badge IDs from the backend",
        "`useUnlockBadge` calls the backend `unlockBadge` function and invalidates the unlocked badges query on success",
        "Both hooks follow the existing patterns in `useQueries.ts`"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useGetUnlockedBadges query hook that calls actor.getUnlockedBadges() to fetch the authenticated user's unlocked badge IDs. Use queryKey ['unlockedBadges'] and enable the query only when actor is available. Add a useUnlockBadge mutation hook that calls actor.unlockBadge(badgeId) and invalidates the 'unlockedBadges' and 'currentUserProfile' queries on success. Both hooks follow the existing patterns in useQueries.ts, including error handling and query client invalidation."
        }
      ]
    }
  ]
}